modm-ext/data.modm.io/docs/svd/header_stm32l151xc.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="OPAMP">
      <name>OPAMP1</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <alternatePeripheral>OPAMP</alternatePeripheral>
      <baseAddress>0x40007c5c</baseAddress>
    </peripheral>
    <peripheral>
      <name>OPAMP12_COMMON</name>
      <groupName>OPAMP_Common</groupName>
      <alternatePeripheral>OPAMP</alternatePeripheral>
      <baseAddress>0x40007c5c</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>OPAMP control and status register, used for bits common to several OPAMP instances</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPA1PD</name>
              <description>OPAMP1 disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S3SEL1</name>
              <description>Switch 3 for OPAMP1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDALONE</name>
                  <description>OPAMP functional mode, OPAMP operation in standalone (on STM32L1 series, it corresponds to OPAMP internal switches S3 opened (switch SanB state depends on switch S4 state))</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOLLOWER</name>
                  <description>OPAMP functional mode, OPAMP operation in follower (on STM32L1 series, it corresponds to OPAMP internal switches S3 and SanB closed)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S4SEL1</name>
              <description>Switch 4 for OPAMP1 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S5SEL1</name>
              <description>Switch 5 for OPAMP1 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S6SEL1</name>
              <description>Switch 6 for OPAMP1 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA1CAL_L</name>
              <description>OPAMP1 Offset calibration for P differential pair</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA1CAL_H</name>
              <description>OPAMP1 Offset calibration for N differential pair</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA1LPM</name>
              <description>OPAMP1 Low power enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA2PD</name>
              <description>OPAMP2 disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S3SEL2</name>
              <description>Switch 3 for OPAMP2 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S4SEL2</name>
              <description>Switch 4 for OPAMP2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S5SEL2</name>
              <description>Switch 5 for OPAMP2 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S6SEL2</name>
              <description>Switch 6 for OPAMP2 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA2CAL_L</name>
              <description>OPAMP2 Offset calibration for P differential pair</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA2CAL_H</name>
              <description>OPAMP2 Offset calibration for N differential pair</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA2LPM</name>
              <description>OPAMP2 Low power enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANAWSEL1</name>
              <description>Switch ANA Enable for OPAMP1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANAWSEL2</name>
              <description>Switch ANA Enable for OPAMP2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S7SEL2</name>
              <description>Switch 7 for OPAMP2 Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AOP_RANGE</name>
              <description>Common to several OPAMP instances: Operational amplifier voltage supply range. Bit intended to be used with OPAMP common instance (OPAMP_Common_TypeDef)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Power supply range low. On STM32L1 series: Vdda lower than 2.4V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Power supply range high. On STM32L1 series: Vdda higher than 2.4V.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPA1CALOUT</name>
              <description>OPAMP1 calibration output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPA2CALOUT</name>
              <description>OPAMP2 calibration output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTR</name>
          <description>OPAMP</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AO1_OPT_OFFSET_TRIM_LOW</name>
              <description>Offset trim for transistors differential pair PMOS of OPAMP1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AO1_OPT_OFFSET_TRIM_HIGH</name>
              <description>Offset trim for transistors differential pair NMOS of OPAMP1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AO2_OPT_OFFSET_TRIM_LOW</name>
              <description>Offset trim for transistors differential pair PMOS of OPAMP2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AO2_OPT_OFFSET_TRIM_HIGH</name>
              <description>Offset trim for transistors differential pair NMOS of OPAMP2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OT_USER</name>
              <description>Switch to OPAMP offset user trimmed values</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FACTORY</name>
                  <description>OPAMP trimming factors set to factory values</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER</name>
                  <description>OPAMP trimming factors set to user values</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
